# ==========================================================
# Задание №5
#
# Автомат обрабатывает натуральное число N по следующему алгоритму:
# 1. Строится двоичная запись числа N.
# 2. Если N четное, то в конец полученной записи (справа) дописывается 0, в начало – 1;
#    Если N – нечётное в конец и начало дописывается по две единицы.
# 3. Результат переводится в десятичную систему и выводится на экран.
#
# Пример. Дано число N = 13. Алгоритм работает следующим образом:
# 1. Двоичная запись числа N: 1101.
# 2. Число нечетное, следовательно по две единицы по краям – 11110111.
# 3. На экран выводится число 247.
#
# Укажите наименьшее число, большее 52, которое может являться результатом работы автомата.
# ==========================================================

otv = []  # Создаём пустой список для хранения результатов
for n in range(1, 1000):  # Перебираем натуральные числа от 1 до 999
    r = bin(n)[2:]  # Переводим число n в двоичную систему и убираем префикс '0b'
    if n % 2 == 0:  # Если число n чётное
        r = '1' + r + '0'  # Добавляем в начало 1, а в конец 0
    else:  # Иначе, если число n нечётное
        r = '11' + r + '11'  # Добавляем по две единицы в начало и конец
    r = int(r, 2)  # Переводим полученную двоичную запись в десятичное число
    if r > 52:  # Проверяем, больше ли результат числа 52
        otv.append(r)  # Если да, добавляем результат в список otv
print(min(otv))  # Выводим наименьший результат, который больше 52

1
1
11




# ----Полезные команды-----
# print(bin(6))
# print(int('0b110', 2))
# print(0b110)








